zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K342_SIUL2.h
  __I  uint8_t GPDI47;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152C */
  __I  uint8_t GPDI46;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152D */
  __I  uint8_t GPDI45;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152E */
  __I  uint8_t GPDI44;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x152F */
  __I  uint8_t GPDI51;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1530 */
  __I  uint8_t GPDI50;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1531 */
  __I  uint8_t GPDI49;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1532 */
  __I  uint8_t GPDI48;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1533 */
  __I  uint8_t GPDI55;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1534 */
  __I  uint8_t GPDI54;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1535 */
  __I  uint8_t GPDI53;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1536 */
  __I  uint8_t GPDI52;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1537 */
  __I  uint8_t GPDI59;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1538 */
  __I  uint8_t GPDI58;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1539 */
  __I  uint8_t GPDI57;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153A */
  __I  uint8_t GPDI56;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153B */
  uint8_t RESERVED_24[2];
  __I  uint8_t GPDI61;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153E */
  __I  uint8_t GPDI60;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x153F */
  __I  uint8_t GPDI67;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1540 */
  __I  uint8_t GPDI66;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1541 */
  __I  uint8_t GPDI65;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1542 */
  __I  uint8_t GPDI64;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1543 */
  __I  uint8_t GPDI71;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1544 */
  __I  uint8_t GPDI70;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1545 */
  __I  uint8_t GPDI69;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1546 */
  __I  uint8_t GPDI68;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1547 */
  __I  uint8_t GPDI75;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1548 */
  __I  uint8_t GPDI74;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1549 */
  __I  uint8_t GPDI73;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154A */
  __I  uint8_t GPDI72;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154B */
  __I  uint8_t GPDI79;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154C */
  __I  uint8_t GPDI78;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154D */
  __I  uint8_t GPDI77;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154E */
  __I  uint8_t GPDI76;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x154F */
  __I  uint8_t GPDI83;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1550 */
  __I  uint8_t GPDI82;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1551 */
  __I  uint8_t GPDI81;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1552 */
  __I  uint8_t GPDI80;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1553 */
  __I  uint8_t GPDI87;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1554 */
  uint8_t RESERVED_25[1];
  __I  uint8_t GPDI85;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1556 */
  __I  uint8_t GPDI84;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1557 */
  __I  uint8_t GPDI91;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1558 */
  __I  uint8_t GPDI90;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1559 */
  __I  uint8_t GPDI89;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155A */
  __I  uint8_t GPDI88;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155B */
  __I  uint8_t GPDI95;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155C */
  __I  uint8_t GPDI94;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155D */
  __I  uint8_t GPDI93;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155E */
  __I  uint8_t GPDI92;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x155F */
  __I  uint8_t GPDI99;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1560 */
  __I  uint8_t GPDI98;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1561 */
  __I  uint8_t GPDI97;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1562 */
  __I  uint8_t GPDI96;                             /**< SIUL2 GPIO Pad Data Input, offset: 0x1563 */
  __I  uint8_t GPDI103;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1564 */
  __I  uint8_t GPDI102;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1565 */
  __I  uint8_t GPDI101;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1566 */
  __I  uint8_t GPDI100;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1567 */
  __I  uint8_t GPDI107;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1568 */
  __I  uint8_t GPDI106;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1569 */
  __I  uint8_t GPDI105;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156A */
  __I  uint8_t GPDI104;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156B */
  __I  uint8_t GPDI111;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156C */
  __I  uint8_t GPDI110;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156D */
  __I  uint8_t GPDI109;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156E */
  __I  uint8_t GPDI108;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x156F */
  uint8_t RESERVED_26[2];
  __I  uint8_t GPDI113;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1572 */
  __I  uint8_t GPDI112;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1573 */
  __I  uint8_t GPDI119;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1574 */
  __I  uint8_t GPDI118;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1575 */
  __I  uint8_t GPDI117;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1576 */
  __I  uint8_t GPDI116;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1577 */
  __I  uint8_t GPDI123;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1578 */
  __I  uint8_t GPDI122;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1579 */
  uint8_t RESERVED_27[1];
  __I  uint8_t GPDI120;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157B */
  __I  uint8_t GPDI127;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157C */
  __I  uint8_t GPDI126;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157D */
  __I  uint8_t GPDI125;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157E */
  __I  uint8_t GPDI124;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x157F */
  __I  uint8_t GPDI131;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1580 */
  __I  uint8_t GPDI130;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1581 */
  __I  uint8_t GPDI129;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1582 */
  __I  uint8_t GPDI128;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1583 */
  __I  uint8_t GPDI135;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1584 */
  __I  uint8_t GPDI134;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1585 */
  __I  uint8_t GPDI133;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1586 */
  __I  uint8_t GPDI132;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1587 */
  __I  uint8_t GPDI139;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1588 */
  __I  uint8_t GPDI138;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1589 */
  __I  uint8_t GPDI137;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158A */
  __I  uint8_t GPDI136;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158B */
  __I  uint8_t GPDI143;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158C */
  __I  uint8_t GPDI142;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158D */
  __I  uint8_t GPDI141;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158E */
  __I  uint8_t GPDI140;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x158F */
  uint8_t RESERVED_28[1];
  __I  uint8_t GPDI146;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1591 */
  __I  uint8_t GPDI145;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1592 */
  __I  uint8_t GPDI144;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1593 */
  __I  uint8_t GPDI151;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1594 */
  __I  uint8_t GPDI150;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1595 */
  __I  uint8_t GPDI149;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1596 */
  uint8_t RESERVED_29[2];
  __I  uint8_t GPDI154;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x1599 */
  __I  uint8_t GPDI153;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159A */
  __I  uint8_t GPDI152;                            /**< SIUL2 GPIO Pad Data Input, offset: 0x159B */
  uint8_t RESERVED_30[356];
  __IO uint16_t PGPDO1;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1700 */
  __IO uint16_t PGPDO0;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1702 */
  __IO uint16_t PGPDO3;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1704 */
  __IO uint16_t PGPDO2;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1706 */
  __IO uint16_t PGPDO5;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1708 */
  __IO uint16_t PGPDO4;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170A */
  __IO uint16_t PGPDO7;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170C */
  __IO uint16_t PGPDO6;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x170E */
  __IO uint16_t PGPDO9;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1710 */
  __IO uint16_t PGPDO8;                            /**< SIUL2 Parallel GPIO Pad Data Out, offset: 0x1712 */
  uint8_t RESERVED_31[44];
  __I  uint16_t PGPDI1;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1740 */
  __I  uint16_t PGPDI0;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1742 */
  __I  uint16_t PGPDI3;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1744 */
  __I  uint16_t PGPDI2;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1746 */
  __I  uint16_t PGPDI5;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1748 */
  __I  uint16_t PGPDI4;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174A */
  __I  uint16_t PGPDI7;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174C */
  __I  uint16_t PGPDI6;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x174E */
  __I  uint16_t PGPDI9;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1750 */
  __I  uint16_t PGPDI8;                            /**< SIUL2 Parallel GPIO Pad Data In, offset: 0x1752 */
  uint8_t RESERVED_32[44];
  __O  uint32_t MPGPDO[SIUL2_MPGPDO_COUNT];        /**< SIUL2 Masked Parallel GPIO Pad Data Out, array offset: 0x1780, array step: 0x4 */
} SIUL2_Type, *SIUL2_MemMapPtr;

