zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K342_SIUL2.h
#define SIUL2_UDR0_UDR19_MASK                    (0x80000U)
#define SIUL2_UDR0_UDR19_SHIFT                   (19U)
#define SIUL2_UDR0_UDR19_WIDTH                   (1U)
#define SIUL2_UDR0_UDR19(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR19_SHIFT)) & SIUL2_UDR0_UDR19_MASK)

#define SIUL2_UDR0_UDR20_MASK                    (0x100000U)
#define SIUL2_UDR0_UDR20_SHIFT                   (20U)
#define SIUL2_UDR0_UDR20_WIDTH                   (1U)
#define SIUL2_UDR0_UDR20(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR20_SHIFT)) & SIUL2_UDR0_UDR20_MASK)

#define SIUL2_UDR0_UDR21_MASK                    (0x200000U)
#define SIUL2_UDR0_UDR21_SHIFT                   (21U)
#define SIUL2_UDR0_UDR21_WIDTH                   (1U)
#define SIUL2_UDR0_UDR21(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR21_SHIFT)) & SIUL2_UDR0_UDR21_MASK)

#define SIUL2_UDR0_UDR22_MASK                    (0x400000U)
#define SIUL2_UDR0_UDR22_SHIFT                   (22U)
#define SIUL2_UDR0_UDR22_WIDTH                   (1U)
#define SIUL2_UDR0_UDR22(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR22_SHIFT)) & SIUL2_UDR0_UDR22_MASK)

#define SIUL2_UDR0_UDR23_MASK                    (0x800000U)
#define SIUL2_UDR0_UDR23_SHIFT                   (23U)
#define SIUL2_UDR0_UDR23_WIDTH                   (1U)
#define SIUL2_UDR0_UDR23(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR23_SHIFT)) & SIUL2_UDR0_UDR23_MASK)

#define SIUL2_UDR0_UDR24_MASK                    (0x1000000U)
#define SIUL2_UDR0_UDR24_SHIFT                   (24U)
#define SIUL2_UDR0_UDR24_WIDTH                   (1U)
#define SIUL2_UDR0_UDR24(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR24_SHIFT)) & SIUL2_UDR0_UDR24_MASK)

#define SIUL2_UDR0_UDR25_MASK                    (0x2000000U)
#define SIUL2_UDR0_UDR25_SHIFT                   (25U)
#define SIUL2_UDR0_UDR25_WIDTH                   (1U)
#define SIUL2_UDR0_UDR25(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR25_SHIFT)) & SIUL2_UDR0_UDR25_MASK)

#define SIUL2_UDR0_UDR26_MASK                    (0x4000000U)
#define SIUL2_UDR0_UDR26_SHIFT                   (26U)
#define SIUL2_UDR0_UDR26_WIDTH                   (1U)
#define SIUL2_UDR0_UDR26(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR26_SHIFT)) & SIUL2_UDR0_UDR26_MASK)

#define SIUL2_UDR0_UDR27_MASK                    (0x8000000U)
#define SIUL2_UDR0_UDR27_SHIFT                   (27U)
#define SIUL2_UDR0_UDR27_WIDTH                   (1U)
#define SIUL2_UDR0_UDR27(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR27_SHIFT)) & SIUL2_UDR0_UDR27_MASK)

#define SIUL2_UDR0_UDR28_MASK                    (0x10000000U)
#define SIUL2_UDR0_UDR28_SHIFT                   (28U)
#define SIUL2_UDR0_UDR28_WIDTH                   (1U)
#define SIUL2_UDR0_UDR28(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR28_SHIFT)) & SIUL2_UDR0_UDR28_MASK)

#define SIUL2_UDR0_UDR29_MASK                    (0x20000000U)
#define SIUL2_UDR0_UDR29_SHIFT                   (29U)
#define SIUL2_UDR0_UDR29_WIDTH                   (1U)
#define SIUL2_UDR0_UDR29(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR29_SHIFT)) & SIUL2_UDR0_UDR29_MASK)

#define SIUL2_UDR0_UDR30_MASK                    (0x40000000U)
#define SIUL2_UDR0_UDR30_SHIFT                   (30U)
#define SIUL2_UDR0_UDR30_WIDTH                   (1U)
#define SIUL2_UDR0_UDR30(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR30_SHIFT)) & SIUL2_UDR0_UDR30_MASK)

#define SIUL2_UDR0_UDR31_MASK                    (0x80000000U)
#define SIUL2_UDR0_UDR31_SHIFT                   (31U)
#define SIUL2_UDR0_UDR31_WIDTH                   (1U)
#define SIUL2_UDR0_UDR31(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR0_UDR31_SHIFT)) & SIUL2_UDR0_UDR31_MASK)
/*! @} */

/*! @name UDR3 - SIUL2 User Defined */
/*! @{ */

#define SIUL2_UDR3_UDR0_MASK                     (0x1U)
#define SIUL2_UDR3_UDR0_SHIFT                    (0U)
#define SIUL2_UDR3_UDR0_WIDTH                    (1U)
#define SIUL2_UDR3_UDR0(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR0_SHIFT)) & SIUL2_UDR3_UDR0_MASK)

#define SIUL2_UDR3_UDR1_MASK                     (0x2U)
#define SIUL2_UDR3_UDR1_SHIFT                    (1U)
#define SIUL2_UDR3_UDR1_WIDTH                    (1U)
#define SIUL2_UDR3_UDR1(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR1_SHIFT)) & SIUL2_UDR3_UDR1_MASK)

#define SIUL2_UDR3_UDR2_MASK                     (0x4U)
#define SIUL2_UDR3_UDR2_SHIFT                    (2U)
#define SIUL2_UDR3_UDR2_WIDTH                    (1U)
#define SIUL2_UDR3_UDR2(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR2_SHIFT)) & SIUL2_UDR3_UDR2_MASK)

#define SIUL2_UDR3_UDR3_MASK                     (0x8U)
#define SIUL2_UDR3_UDR3_SHIFT                    (3U)
#define SIUL2_UDR3_UDR3_WIDTH                    (1U)
#define SIUL2_UDR3_UDR3(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR3_SHIFT)) & SIUL2_UDR3_UDR3_MASK)

#define SIUL2_UDR3_UDR4_MASK                     (0x10U)
#define SIUL2_UDR3_UDR4_SHIFT                    (4U)
#define SIUL2_UDR3_UDR4_WIDTH                    (1U)
#define SIUL2_UDR3_UDR4(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR4_SHIFT)) & SIUL2_UDR3_UDR4_MASK)

#define SIUL2_UDR3_UDR5_MASK                     (0x20U)
#define SIUL2_UDR3_UDR5_SHIFT                    (5U)
#define SIUL2_UDR3_UDR5_WIDTH                    (1U)
#define SIUL2_UDR3_UDR5(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR5_SHIFT)) & SIUL2_UDR3_UDR5_MASK)

#define SIUL2_UDR3_UDR6_MASK                     (0x40U)
#define SIUL2_UDR3_UDR6_SHIFT                    (6U)
#define SIUL2_UDR3_UDR6_WIDTH                    (1U)
#define SIUL2_UDR3_UDR6(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR6_SHIFT)) & SIUL2_UDR3_UDR6_MASK)

#define SIUL2_UDR3_UDR7_MASK                     (0x80U)
#define SIUL2_UDR3_UDR7_SHIFT                    (7U)
#define SIUL2_UDR3_UDR7_WIDTH                    (1U)
#define SIUL2_UDR3_UDR7(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR7_SHIFT)) & SIUL2_UDR3_UDR7_MASK)

#define SIUL2_UDR3_UDR8_MASK                     (0x100U)
#define SIUL2_UDR3_UDR8_SHIFT                    (8U)
#define SIUL2_UDR3_UDR8_WIDTH                    (1U)
#define SIUL2_UDR3_UDR8(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR8_SHIFT)) & SIUL2_UDR3_UDR8_MASK)

#define SIUL2_UDR3_UDR9_MASK                     (0x200U)
#define SIUL2_UDR3_UDR9_SHIFT                    (9U)
#define SIUL2_UDR3_UDR9_WIDTH                    (1U)
#define SIUL2_UDR3_UDR9(x)                       (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR9_SHIFT)) & SIUL2_UDR3_UDR9_MASK)

#define SIUL2_UDR3_UDR10_MASK                    (0x400U)
#define SIUL2_UDR3_UDR10_SHIFT                   (10U)
#define SIUL2_UDR3_UDR10_WIDTH                   (1U)
#define SIUL2_UDR3_UDR10(x)                      (((uint32_t)(((uint32_t)(x)) << SIUL2_UDR3_UDR10_SHIFT)) & SIUL2_UDR3_UDR10_MASK)

